export enum ProductTypeEnum {
  MUSICAL = 'musical', 
  // 뮤지컬
  SHUTTLE = 'shuttle', 
  // 셔틀, JFK
  TICKET = 'ticket',
  // 전망대(탑 오브 더 락, 원 월드, 엠파이어, 엣지, 써밋(오프,피크))
  // 크루즈(여신상(랜드마크), 여신상(나이트), 여신상(미드타운), 여신상(다운타운), 여신상(엘리스))
  // 미술관/박물관(메트로폴리탄, 모마, 구겐하임, 휘트니, 자연사, 911, 해양 우주 항공, 마담투소+마블4D)
  // 액티비티(라이즈 뉴욕,버드랜드 재즈, 올데이 자전거, 센트럴파크 울먼 아이스링크(로우,하이),양키스(오프,피크),메츠 MLB)
  // 버스투어(탑뷰24,탑뷰24+크루즈,탑뷰48,탑뷰48+크루즈)
  // 교통(우드버리아울렛,뉴욕메트로,셔틀)
  // 테마파크(니켈로디언,더링크,드림웍스,빅스노우,레고랜드,씨라이프,미러메이즈,미니골프(블랙라이트,앵그리버드))
  DOCENT = 'docent',
  // 그룹(모마, 메트로 폴리탄, 메트로 폴리탄(회화명작), 자연사)
  // 단독(모마, 메트로 폴리탄, 구겐하임, 휘트니)
  TOUR = 'tour', // GUIDE = 'guide',
  // 그룹(업타운, 미드타운, 다운타운, 여신상, 브루클린 선셋, 크리스마스, 랜드마크(낮/야경) UN)
  // 단독(아이비리그 대학, 뉴욕 야경, 내맘대로 종일, 우드버리 아울렛)
  // 근교(나이아가라(당일), 나이아가라(1박), 보스턴&아이비리그, 워싱턴, 필라델피아&아이비리그)
  USIM = 'usim',
  // 라이카, 티모바일, 에이치투오
  SNAP = 'snap',
  STAY = 'stay',
  // 맨하탄, 허드슨
}
